circular-cylinder-2-40/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6.0
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       18940;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       19020;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       19100;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       19200;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          160;
        startFace       19300;
    }
    frontandback
    {
        type            empty;
        inGroups        1(empty);
        nFaces          19200;
        startFace       19460;
    }
)

// ************************************************************************* //
